cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/services'

brew 'dnsmasq'
brew 'nmap'
brew 'node'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'font-roboto-mono'
cask 'iterm2'
cask 'quip'
cask 'rescuetime'
cask 'slate'
cask 'sublime-text'

brew 'mas'
mas 'Xcode', id: 497799835
